export const rules = [
  {
    label: "Основное",
    content: [
      "0. ДПГ 3 - это вершина технологического прогресса человечества, в котором не существует никаких проблем. Если вы заметили какие-либо недочеты, вам это приснилось",
      "1. Игроки соревнуются на игровом поле и пытаются пройти как можно больше игр. 'Забег' длится ОЧЕНЬ МНОГО дней [пока все участники не дропнут ивент]. Победителем становится тот Саня, ведь он разраб",
      "2. Во время проведения ДПГ, игроки будут активировать Колесо Приколов. Один ролл колеса стоит 100 чубриков. В Колесе Приколов игрок может: зароллить предмет [Любой предмет, предмет Бафф или предмет Дебафф], посмотреть все предметы, зароллить игру из пресета, зароллить случайный пресет, зароллить случайного пользователя или использовать кастомный список для ролла",
      "3. Правила реролла игры: a) Игра, которая не может быть завершена, не имеет концовки (ММО, песочница). b) VR-игра. c) Игра не запускается или имеет плохой префоманс на компьютере игрока. d) Игра представляет из себя DLC к основной игре и требует установки этой самой основной игры. e) Игра не имеет русского или английского интерфейса и перевод не может быть установлен отдельно (опционально). f) Игра у конкретного игрока выпадает второй раз, или это ремастер уже выпадавшей игры, или это оригинал ремастера. Рероллы и дропы не учитываются, только пройденные игры. g) Обязательным рероллом являются визуальные новеллы, текстовые РПГ, Тривии и подобные викторины. Визуальной новеллой считается игра с практически полным отсутствием геймплея (пример - редкие мини-игры в такин новеллах, как DDLC), кроме чтения текста и принятия каких-либо выборов. Текстовой РПГ считается любая игра, где кроме текста нет ничего. h) Игры в раннем доступе могут быть дропнуты по усмотрению игрока. Если игрок не рерольнул игру в раннем доступе, а спустя время [более 30 минут], он обнаружил, что игра непроходима, он может ее только дропнуть. i) Если игроку выпал сборник игр, то он обязан пройти только 1 часть из сборника. Игрок может выбрать пройти все игры из сборника, но это будет засчитано за 1 прохождение. Данное правило не работает на пресеты. j) Игрок может рероллить любой спортивный или гоночный симулятор по своему усмотрению. Если у игры есть прохождение, игрок имеет право на прохождение этой игры. k) Если игрок начал проходить какую-то игру, которая, казалось бы, подходит по всем правилам, то, аналогичну правилу про игры в раннем доступе, игрок имеет 30 минут на легитимный реролл игры. После прошествия этих 30 минут, игрок может только дропнуть игру. Исключением из правила считаются моменты, когда игра имеет баги, которые мешают прохождению",
      "4. Игра считается пройденной, если: a) Появились финальные титры (кроме шуточных концовок). b) Пройдены все уровни (например, в играх 'три-в-ряд'). c) Побит рекорд установленный разработчиком (High Score) d)  Рогалик (rogue-like) считается пройденным после первой победы над финальным боссом (после которого игрока переносит в меню)",
      "5. Запрещено использовать чит-коды, трейнеры, сторонние программы для облегчения процесса игры. Баги и глитчи разрешены, если игрок сам узнал об их существовании. Использование модов обговаривается другими участниками",
      "6. Уровень сложности - средний из возможных вариантов. Игрок имеет возможность сам выбрать уровень сложности игры [Но не изи или его аналоги]. Если в игре нет уровня сложности, но есть разные режимы, то игрок выбирает его аналогично сложности. Если выбор состоит из двух вариантов, то игрок может выбрать более простой. Запрещены настройки, которые влияют на сложность игры",
      "9. При дропе, игрок перемещается на клетку Тюрьмы и проходит там игру. При повторном дропе на клетке Тюрьма, игрок заново роллит игру по нужным условиям",
      "10. Смотреть прохождение игры запрещено. Проследить за этим почти невозможно, поэтому это остается на совести игрока",
      "11. Любые непредвиденные события решаются игроком по его усмотрению при отсутствии свидетелей",
      "12. Игроку запрещено скипать кат-сцены и пропускать важные моменты игры, если игрок не видел или не проходил их до этого",
      "13. Если игроку выпала кооп игра, он может позвать кого-то пройти игру с ним. За помощь в прохождении игры, приглашенный участник получает бесплатный скип на текущую или следующую выпавшую игру",
      "14. Если вы рерролите больше 3 раз подряд НЕ легитимно, то вы сдохните",
      "15. Если, при ролле игры, используется эффект на выбор одной из игр на колесе самим игроком или другими участниками, то нужно смотреть на эти игры по правилу реролла игр. Если таких игр, которые нужно рероллить, половина или больше от количества игр на выбор, то такое колесо рероллится",
      "16. Если игрок прокрутил колесо, но не смог найти игру для скачивания, то, если не применены никакие условия на время прохождения игры, то игрок может добавить сам выставить минимальное время прохождения игры 1 час",
      "17. Если игрок может использовать несколько предметов в одной ЛЮТОЙ комбинации, то он может использовать их в порядке лютости для этой комбинации",
      "18. Если игроку нужно не проходить игру, а что-то смотреть, то другие участники могут присоедениться к нему, за что получают бесплатный ролл предмета",
      "19. Если игроку нужно переместиться назад, а он значение кубика на перемещение попадает за клетку СТАРТ, то игрок останавливается на клетке СТАРТ и не может зайти за нее каким-либо способом. Какие-либо предметы или другие участники не могут переместить кого-либо за клетку СТАРТ",
    ],
  },
  {
    label: "Правила хода",
    content: [
      "Каждый игрок начинает с 0 клетки [СТАРТ]. Для перемещения по клетке необходимо кинуть кубик 1d6. Выпавшее значение - то количество клеток, которое этот игрок проходит. Чтобы совершить следующий ход, игрок должен выполнить условия клетки или использовать предмет на перемещение. Игрок НЕ ждет других участников и окончания их хода. Как только он прошел игру на клетке, игрок захватывает эту клетку и получает право на бросок кубика на перемещение по игровому полю. Ограничений на количество ходов нет, но есть играничения на ролл игры. Их можно роллить только после 6:00 и до 23:59 по локальному времени",
    ],
  },
  {
    label: "Предметы",
    content: [
      "Предметы могут быть четырех типов: Баффы [Предметы, позитивно влияющие на игрока], Дебаффы [Предметы, негативно влияющие на игрока], Предметы-Ловушки [Предметы, которые отправляются другому участнику] и Нейтральные [Предметы, которые не имеют никакого из предыдущих типов. Они могут оказать как положительное, так и отрицательное влияние на игрока]. Перед передачей предмета другому участнику, нужно убедиться в том, что у него есть возможность принять этот предмет. Бывают случаи, когда предмет может заменить другой. В таком случае, игрок смотрит на тип предмета: если у предмета тип Баффа, то он имеет приоритет выше, чем у любого другого, если у предмета тип Дебаффа, то он имеет приоритет выше, чем у Нейтрального предмета",
    ],
  },
  {
    label: "Карта",
    content: [
      "Карта имеет несколько типов клеток:",
      "Обычная клетка - обычная клетка с условиями для захвата",
      "Тюрьма - в случае дропа, игрок перемещается на ближайшую клетку тюрьмы. Для выхода с этой клетки, игрок обязан выполнить условия захвата клетки, после чего он выходит из тюрьмы. В случае дропа игры на клетке тюрьмы, игрок остается на месте для ролла следующей игры. При ролле игры на клетке тюрьма, если игрок находится в тюрьме из-за дропа, игра выбирается из выпавшей и двух соседних",
      "Парковка - клетка, на которой условием захвата является прохождение случайной игры из списка библиотеки Стим игрока. Если игра не подходит под условия реролла игры, но игрок когда-либо проходил ее (кроме текущего ивента), игрок обязан ее пройти",
      "Старт - каждый раз, когда игрок перемещается на эту клетку, он получает 250 чубриков. Для получения чубриков, игрок обязан остановиться на этой клетке, после чего продолжить движение на столько клеток, сколько ему осталось",
      "После захвата клетки, на клетке появляется налог. Если игрок наступит на клетку, на которой существует налог, он платит необходимое число чубриков. Вычитаемый налог не выплачивается участнику, захватившему эту клетку. Захватить клетку могут несколько участников, налог при этом не повышается",
      "Клетки типов Тюрьма и Старт не добавляют налог",
    ],
  },
  {
    label: "Запросы API",
    content: [
      "Из-за некоторых нюансов при использовании сторонних API [для DPG - 'Получение игры стим' и 'Получение картинок котов', есть определенные ограничения на количество запросов в минуту. Их количество составляет около 20. Если произошла ошибка при выполнение каких-либо из этих запросов, просто подождите [ебучий CORS]",
    ],
  },
];
